v2206/MSc_icedAirfoil/smooth_resolve/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

// turluent intensity 0.5%
internalField   uniform 0.0084375;

// turluent intensity 1%
// internalField   uniform 0.03375;

// turluent intensity 5%
// internalField   uniform 0.84375;

boundaryField
{
    airfoil
    {
        // type            kqRWallFunction;
        // value           $internalField;
        // type            zeroGradient;

        type            fixedValue;
        // value           $internalField;
        value           uniform 1e-16;
    }

    west
    {
        type            fixedValue;
        value           $internalField;
    }

    east
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    north
    {
        type            slip;
    }

    south
    {
        type            slip;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}
// ************************************************************************* //
