v2206/MSc_icedAirfoil/smooth_resolve/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
    // default            steadyState;
}

gradSchemes
{
    default             cellLimited Gauss linear 1;;

    // default             Gauss linear;
    // grad(U)             Gauss linear;
}

divSchemes
{
    default             none;
    
    div(phi,U)          bounded Gauss linearUpwind grad(U);

    div(phi,k)          bounded Gauss linearUpwind grad(k);
    div(phi,epsilon)    bounded Gauss linearUpwind grad(epsilon);
    div(phi,omega)      bounded Gauss linearUpwind grad(omega);

    // div(phi,k)          bounded Gauss upwind;
    // div(phi,epsilon)    bounded Gauss upwind;
    // div(phi,omega)      bounded Gauss upwind;
    
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    // default             Gauss linear limited corrected 0.5;
    default             Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             corrected;
}

wallDist
{
    method              meshWave;
}


// ************************************************************************* //
